In [8]:
import numpy as np
import pandas as pd

In [9]:
df = pd.read_csv('University.csv')

In [10]:
df.head()

,University,Student_Name,Grades,Fees(Overall),Hobbies,Date_of_Admission
0,Harvard University.,Stuart,8.0,$80000,Painting,08-02-2022
1,Massachusetts Institute of Technology.,Rosemarry,9.0,$75000,Driving,11-02-2022
2,Stanford University.,Flamingo,9.5,$67770,Photography,12-02-2022
3,University of California,Kiara,8.0,$77000,Travelling,13-11-2021
4,The University of Oxford in Oxford.,Oliver,7.5,$95000,Travelling,14-11-2021

In [5]:
df.tail()

,University,Student_Name,Grades,Fees(Overall),Hobbies,Date_of_Admission
4,The University of Oxford in Oxford.,Oliver,7.5,$95000,Travelling,14-11-2021
5,Columbia University.,Emma,8.0,$56000,Choreography,28-11-2021
6,California Institute of Technology.,Charollete,8.0,$60000,Planting,26-11-2021
7,University of Washington.,James,9.5,$75000,Photography,20-02-2022
8,University of Texas,Jennifies,9.0,$50000,Driving,21-02-2022

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   University         9 non-null      object
 1   Student_Name       9 non-null      object
 2   Grades             9 non-null      float64
 3   Fees(Overall)      9 non-null      object
 4   Hobbies            9 non-null      object
 5   Date_of_Admission  9 non-null      object
dtypes: float64(1), object(5)
memory usage: 564.0+ bytes

In [7]:
df.shape

(9, 6)

In [15]:
df['University'].shape[0]

9

In [57]:
df = pd.read_csv('University.csv')
df.drop('Hobbies',axis=1,inplace=True)
df

,University,Student_Name,Grades,Fees(Overall),Date_of_Admission
0,Harvard University.,Stuart,8.0,$80000,08-02-2022
1,Massachusetts Institute of Technology.,Rosemarry,9.0,$75000,11-02-2022
2,Stanford University.,Flamingo,9.5,$67770,12-02-2022
3,University of California,Kiara,8.0,$77000,13-11-2021
4,The University of Oxford in Oxford.,Oliver,7.5,$95000,14-11-2021
5,Columbia University.,Emma,8.0,$56000,28-11-2021
6,California Institute of Technology.,Charollete,8.0,$60000,26-11-2021
7,University of Washington.,James,9.5,$75000,20-02-2022
8,University of Texas,Jennifies,9.0,$50000,21-02-2022

In [19]:
df['University']

0                       Harvard University.
1    Massachusetts Institute of Technology.
2                      Stanford University.
3                  University of California
4       The University of Oxford in Oxford.
5                      Columbia University.
6       California Institute of Technology.
7                 University of Washington.
8                       University of Texas
Name: University, dtype: object

In [42]:
df = pd.read_csv('University.csv')
df['Date_of_Admission'] = pd.to_datetime(df['Date_of_Admission'],dayfirst=True)
print(df['Date_of_Admission'])

0   2022-02-08
1   2022-02-11
2   2022-02-12
3   2021-11-13
4   2021-11-14
5   2021-11-28
6   2021-11-26
7   2022-02-20
8   2022-02-21
Name: Date_of_Admission, dtype: datetime64[ns]

In [50]:
df['Month']=df['Date_of_Admission'].dt.month
print(df['Month'])

0     2
1     2
2     2
3    11
4    11
5    11
6    11
7     2
8     2
Name: Month, dtype: int32

In [51]:
df.head()

,University,Student_Name,Grades,Fees(Overall),Hobbies,Date_of_Admission,Month
0,Harvard University.,Stuart,8.0,$80000,Painting,2022-02-08,2
1,Massachusetts Institute of Technology.,Rosemarry,9.0,$75000,Driving,2022-02-11,2
2,Stanford University.,Flamingo,9.5,$67770,Photography,2022-02-12,2
3,University of California,Kiara,8.0,$77000,Travelling,2021-11-13,11
4,The University of Oxford in Oxford.,Oliver,7.5,$95000,Travelling,2021-11-14,11

In [52]:
df.tail()

,University,Student_Name,Grades,Fees(Overall),Hobbies,Date_of_Admission,Month
4,The University of Oxford in Oxford.,Oliver,7.5,$95000,Travelling,2021-11-14,11
5,Columbia University.,Emma,8.0,$56000,Choreography,2021-11-28,11
6,California Institute of Technology.,Charollete,8.0,$60000,Planting,2021-11-26,11
7,University of Washington.,James,9.5,$75000,Photography,2022-02-20,2
8,University of Texas,Jennifies,9.0,$50000,Driving,2022-02-21,2

In [63]:
matA=[[0.63210023, 0.99338139, 0.16793459],[0.67031607, 0.8320512, 0.51020623],[0.55752543, 0.29201488, 0.19119979]]
matA = np.array(matA)

In [ ]:
mat